createSurfaceFromCurves(GCurve!System.Runtime.CompilerServices.IsConst*,GCurve!System.Runtime.CompilerServices.IsConst*,System.Boolean,System.Boolean)
Create a surface from two curves, where one of the curves is a line.
The surface is obtained by extruding the non-line curve along the line's direction.
The extrusion distance will be equal to the line length.
In the case of two lines, the first line will be extruded along the second line's direction.
The surface' oriented normal vector at the base point has the same
direction as T1 x T2, the cross product of the
tangent vectors of pCrv1 and pCrv2, respectively.
If setEnvelope is true, the surface's envelope will be set based on the bounds of the
curves. If setEnvelope is true and the curves are not bounded, an error is returned.
Returns the newly created surface, or 0 if an error occurred.
bAllowAnySurface allow surface creation when parameterization described above is not possible
for example arc extruded along line in its plane when arc has point with derivative parallel to that line.
this could be the only case implemented